Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd
s = pd.Series([4,8,15,16,23,42])

In [5]:
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
l = [1,2,3,4,5,6,7,8,9,10]
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [7]:
df = pd.DataFrame({'Name':['Alice','Bob','Claire'],
                  'Age':[25,30,27],'Gender':['Female','Male','Female']})

In [8]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different data types.
A DataFrame can be thought of as a collection of Series objects, where each Series represents a column in the DataFrame. Unlike Series, which represent a one-dimensional labeled array, a DataFrame represents a two-dimensional labeled array with columns and rows.

In [9]:
import pandas as pd

data = [
    {"name": "John", "age": 25, "city": "New York"},
    {"name": "Sarah", "age": 30, "city": "London"},
    {"name": "Bill", "age": 35, "city": "Paris"}
]


df = pd.DataFrame(data)

age_series = df["age"]

print("DataFrame:")
print(df)

print("\nSeries:")
print(age_series)

DataFrame:
    name  age      city
0   John   25  New York
1  Sarah   30    London
2   Bill   35     Paris

Series:
0    25
1    30
2    35
Name: age, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head(n) and tail(n),describe(),groupby(),fillna(),drop()

In [11]:
df

    name  age      city
0   John   25  New York
1  Sarah   30    London
2   Bill   35     Paris

In [14]:
'''drop(): This function drops rows or columns from the DataFrame based on specified criteria, 
such as missing values or duplicate values'''


df.drop("city",axis=1)

    name  age
0   John   25
1  Sarah   30
2   Bill   35

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature, meaning that their values can be changed after creation. However, Panel is not mutable and its values cannot be changed after creation.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [15]:
s1 = pd.Series([1,2,3])
s2 = pd.Series(['x','y','z'])

In [23]:
pd.DataFrame({'a':s1,'b':s2},index=["A","B","C"])

    a    b
A NaN  NaN
B NaN  NaN
C NaN  NaN